import React, { useState } from 'react'
import '../../assets/Styles/Footer.css'
export const Footer = () => {
  const [TextBishtar, setBishtar] = useState(false);
  return (
    <footer>
      <div className='footerContainer'>
        <div className="topCont">
          <div className='logoBazgasht'>

            {/* //اسکرول به بالا */}
            <button className='Bazgashan' onClick={() => { window.scrollTo({ top: 0, behavior: 'smooth' }) }}>
              بازگشت به بالا
            </button>
            <div className='footerLogoCont'>
              <img src="/src/assets/IMGS/DigiKalaLOGO.svg" alt="digikala" />
            </div>
          </div>

          <div className='poshtibaniCont' dir='rtl'>
            <div>تلفن پشتیبانی ۶۱۹۳۰۰۰۰ - ۰۲۱</div>
            <div style={{ padding: '0 20px' }}>|</div>
            <div>۰۲۱-۹۱۰۰۰۱۰۰</div>
            <div style={{ padding: '0 20px' }}>|</div>
            <div>۷ روز هفته، ۲۴ ساعته پاسخگوی شما هستیم</div>
          </div>

          <div className='tahvil'>
            <div className='tahvil_inner'>
              <div className='tahvil_Img_Cont'>
                <img src="/src/assets/IMGS/Footer/original-products.svg" alt="" />
              </div>
              <p className='tahvil_text'>ضمانت اصل بودن کالا</p>
            </div>
            <div className='tahvil_inner'>
              <div className='tahvil_Img_Cont'>
                <img src="/src/assets/IMGS/Footer/days-return.svg" alt="" />
              </div>
              <p className='tahvil_text'>هفت روز ضمانت بازگشت کالا</p>
            </div>
            <div className='tahvil_inner'>
              <div className='tahvil_Img_Cont'>
                <img src="/src/assets/IMGS/Footer/support.svg" alt="" />
              </div>
              <p className='tahvil_text'>7 روز هفته ، 24 ساعته</p>
            </div>
            <div className='tahvil_inner'>
              <div className='tahvil_Img_Cont'>
                <img src="/src/assets/IMGS/Footer/cash.svg" alt="" />
              </div>
              <p className='tahvil_text'>اﻣﮑﺎن ﺗﺤﻮﯾﻞ در محل</p>
            </div>
            <div className='tahvil_inner'>
              <div className='tahvil_Img_Cont'>
                <img src="/src/assets/IMGS/Footer/delivery.svg" alt="" />
              </div>
              <p className='tahvil_text'>اﻣﮑﺎن ﺗﺤﻮﯾﻞ اﮐﺴﭙﺮس</p>
            </div>
          </div>
          <div className='discriptionCont'>
            <div className='etemaadCont'>
              <div className="etemaad">
                <img src="/src/assets/IMGS/Footer/etemad1.png" />
              </div>
              <div className="etemaad">
                <img src="/src/assets/IMGS/Footer/etemad2.webp" />
              </div>
              <div className="etemaad">
                <img src="/src/assets/IMGS/Footer/etemad3.webp" />
              </div>
              <div className="etemaad">
                <img src="/src/assets/IMGS/Footer/etemda4.webp" />
              </div>
            </div>

            <div className='Discript_First_Cont'>
              {/* متن دیجی کالا */}
              <div className={TextBishtar ? 'FooterLongTextCont' : 'FooterLongTextContClosed'}>
                <h1>دیجی کالا؛ بزرگترین فروشگاه اینترنتی ایران</h1>
                <p>دیجی کالا سال‌ها است که به انتخاب اول بسیاری از خریداران اینترنتی تبدیل شده است. دیجی کالا به عنوان بزرگ‌ترین و معتبرترین فروشگاه آنلاین ایران، شناخته‌شده‌ترین فروشگاه نیز محسوب می‌شود. این فروشگاه آنلاین نه‌تنها گسترده‌ترین تنوع کالا را در دسته‌بندی‌های مختلف ارائه می‌دهد، بلکه با خدمات بی‌نظیر، ارسال سریع، ضمانت اصل بودن کالا و پشتیبانی حرفه‌ای، استاندارد جدیدی در خرید اینترنتی ایران تعریف کرده است. این فروشگاه با سال‌ها تجربه و اعتماد مشتریان، کامل‌ترین و بهترین گزینه برای خرید آنلاین در ایران محسوب می‌شود.</p>
                <h2>ویژگی های مهم دیجی کالا</h2>
                <p>یکی از ویژگی‌های مهم در خرید از دیجی کالا، تنوع بی‌نظیر محصولات است. این فروشگاه اینترنتی طیف وسیعی از کالاها را در دسته‌های مختلف از جمله لوازم دیجیتال، لوازم خانگی، مد و پوشاک، لوازم آرایشی و بهداشتی، محصولات سلامت و زیبایی، و بسیاری از محصولات دیگر ارائه می‌دهد. به عنوان مثال، اگر به دنبال خرید یا بررسی </p>
                <h2>ارسال سریع و مطمئن کالا</h2>
                <p>یکی از مهم‌ترین دغدغه‌های کاربران خرید آنلاین، زمان تحویل کالا است. دیجی کالا برای حل این مشکل، گزینه‌های مختلف ارسال را در نظر گرفته است تا کاربران بتوانند بر اساس نیاز خود، روش ارسال مناسب را انتخاب کنند. به عنوان مثال، ارسال کالا به صورت تحویل امروز با ارسال سریع دیجی‌کالا، از جمله روش‌های خرید سریع از این فروشگاه اینترنتی است. این امکانات باعث می‌شود که خریداران بتوانند سفارش خود را در کوتاه‌ترین زمان ممکن دریافت کنند. علاوه بر این، در صورتی که کالای خریداری شده از لحاظ کیفیت یا هر دلیل دیگری رضایت مشتری را جلب نکرده باشد، دیجی کالا ضمانت بازگشت کالا را ارائه می‌دهد. این ویژگی موجب اعتماد بیشتر مشتریان به خرید آنلاین از فروشگاه اینترنتی دیجی کالا شده است.</p>
                <h2>تخفیف های ویژه و جشنواره ها</h2>
                <p>دیجی کالا به طور منظم جشنواره‌ها و تخفیف‌های ویژه‌ای را برگزار می‌کند که برای مشتریان فرصت خرید کالاهای باکیفیت با قیمت‌های مناسب به همراه خواهد داشت. این تخفیف‌ها در ایام خاص مانند بلک فرایدی یا همان حراج جمعه سیاه، خرید هدیه روز مادر و کادو روز پدر، شب یلدا و جشنواره‌های فصلی تابستان و زمستان توجه بسیاری از خریداران را جلب می‌کند. در این جشنواره‌ها، دیجی کالا تخفیف‌های عالی روی محصولات مختلف از جمله گوشی‌های موبایل، لپ تاپ‌ها، تلویزیون‌ها، و حتی محصولات مناسب سازمانی مثل پک هدیه یلدا ارائه می‌دهد. می‌توانید گوشی ایفون ۱۶ یا گوشی S25 را با تخفیف‌های ویژه خریداری کنید و از قیمت مناسب بهره‌مند شوید. دیجی کالا فراتر از یک فروشگاه اینترنتی، یک تجربه خرید مطمئن در بین کاربران مختلف بوده است که با ارائه بزرگ‌ترین تنوع کالا، قیمت‌های مختلف و خدماتی بی‌نقص، به مقصد اول خریداران آنلاین در ایران تبدیل شده است.</p>
                <h2>انواع محصولات فروشگاه دیجی کالا</h2>
                <p>دیجی کالا دارای محصولات متنوعی در گروه‌های مختلف است که خرید آنها بسیار راحت و سریع است. به عنوان مثال، اگر به دنبال قاب گوشی یا هندزفری بلوتوثی باشید، می‌توانید مدل‌های مختلف و برندهای گوناگونی را در این فروشگاه پیدا کنید. </p>
                <h2>موبایل و کالای دیجیتال</h2>
                <p>دیجی‌کالا انواع گوشی‌های هوشمند از برندهای معتبر جهانی مانند سامسونگ، اپل، شیائومی و هواوی را با مشخصات و قیمت‌های متنوع عرضه می‌کند. علاوه بر موبایل، دیجی‌کالا مجموعه‌ای از لوازم جانبی مانند هدفون، هندزفری، ساعت‌های هوشمند، تبلت‌ها و لپ تاپ را نیز در اختیار مشتریان قرار می‌دهد. با امکان مقایسه محصولات، مطالعه نظرات کاربران و دسترسی به جدیدترین مدل‌ها، دیجی‌کالا به یکی از مقاصد اصلی خرید آنلاین در حوزه موبایل و کالای دیجیتال تبدیل شده است. از دهه گذشته همواره دیجی کالا به عنوان اولین گزینه برای خرید گوشی های سامسونگ، آیفون های اپل و گوشی شیائومی محسوب می‌شده است و تا امروز هم در عرضه این موبایل های محبوب به بازار، دیجی‌کالا اولین فروشگاه آنلاین بوده است. </p>
              </div>

              <div onClick={() => { setBishtar((prev) => !prev) }} className='more'>{TextBishtar ? 'بستن' : 'نمایش بیشتر'}</div>
            </div>
          </div>
        </div>
      </div>
    </footer>
  )
}
